var mapOptions = {
    center: new naver.maps.LatLng(34.909904174811246, 126.43572576567227),
    zoom: 16
};

var map = new naver.maps.Map('map', mapOptions);

var markersData = [
    { lat: 34.90690368702702, lng: 126.43209448221145, info: '대운동장' },
    { lat: 34.90785038089997, lng: 126.43359520803607, info: '70주년기념관' },
    { lat: 34.907443551407326, lng: 126.43478792583348, info: '박물관 A5동' },
    { lat: 34.9069657956516, lng: 126.43381464715793, info: '체육관 A4동'},
    { lat: 34.9085842476231, lng: 34.9085842476231, info: '대학본부' },
    { lat: 34.90909977503453, lng: 126.43477383999087, info: '정보종합센터' },
    { lat: 34.90922597717391, lng: 126.4347757105844, info: '국제교류원' },
    { lat: 34.90893633034002, lng: 126.43548619197635, info: '도서관' },
    { lat: 34.91001099503217, lng: 126.43446668516117, info: '플라자60 A60' },
    { lat: 34.90987270365909, lng: 126.43574239423052, info: '학생회관' },
    { lat: 34.91078427414571, lng: 126.43454071384676, info: 'MNU 스퀘어' },
    { lat: 34.91087479122154, lng: 126.43462216033357, info: '목포대학교 정류소' },
    { lat: 34.911758649021095, lng: 126.4352151972348, info: '공동실험실습관' },
    { lat: 34.911398713363155, lng: 126.43583316981008, info: '사범대학' },
    { lat: 34.90816860670159, lng: 126.43612334303891, info: '사회과학대학' },
    { lat: 34.91018583565755, lng: 126.43717915041266, info: '자연과학대학 1호관' },
    { lat: 34.909999423624654, lng: 126.43828831739205, info: '자연과학대학 2호관' },
    { lat: 34.909688648448196, lng: 126.43784454229254, info: '약학대학' },
    { lat: 34.91203176128744, lng: 126.43579601162087, info: '교수회관' },
    { lat: 34.91249574282951, lng: 126.43720441978947, info: '공과대학 1호관' },
    { lat: 34.912801287133725, lng: 126.43651842559696, info: '공과대학 2호관' },
    { lat: 34.9134064511872, lng: 126.43727206691065, info: '공과대학 3호관' },
    { lat: 34.91276976934419, lng: 126.4379849410878, info: '공과대학 4호관' },
    { lat: 34.913504255739106, lng: 126.43844226152825, info: '생활과학관' },
    { lat: 34.914511532387145, lng: 126.43941477967267, info: '공과대학 5호관' },
    { lat: 34.913698343093365, lng: 126.43997017688706, info: '부속공장' },
    { lat: 34.91422223754486, lng: 126.43825408116616, info: '대외협력관' },
    { lat: 34.913914295450176, lng: 126.4384230550571, info: '친환경농업연구센터' },
    { lat: 34.91494404041592, lng: 126.43840509905013, info: '스포츠센터 골프연습장' },
    { lat: 34.91172922263889, lng: 126.4366433818747, info: '족구장' },
    { lat: 34.91186983251597, lng: 126.4368366492294, info: '농구장' },
    { lat: 34.909984018839836, lng: 126.43934434167869, info: '학생생활관' },
    { lat: 34.90950395163689, lng: 126.43981538030648, info: '가람관' },
    { lat: 34.90965296731372, lng: 126.44036694551237, info: '다래관' },
    { lat: 34.9103464049736, lng: 126.44023093329928, info: '햇귀관' },
    { lat: 34.910311056630476, lng: 126.44087402830749, info: '한울관' },
    { lat: 34.909180512214775, lng: 126.4405342824072, info: 'BTL 생활관' }
];

markersData.forEach(function(data) {
    var marker = new naver.maps.Marker({
        position: new naver.maps.LatLng(data.lat, data.lng),
        map: map
    });

    var infowindow = new naver.maps.InfoWindow({
        content: `<div style="padding:10px;">${data.info}</div>`
    });

    naver.maps.Event.addListener(marker, "click", function() {
        infowindow.open(map, marker);
    });
    
});